# SystemType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalSystem..::..SystemType Property
MechanicalSystem Class See Also
---
The type of this duct system.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DuctSystemType SystemType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemType As DuctSystemType
	Get
```

Visual C++
---
```text
public:
property DuctSystemType SystemType {
	DuctSystemType get ();
}
```

# See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace